
var T = darkrp.trigger;

T.flow('进入交易市场', ['登录', '离线登录', '弹窗确定', '积分商城', '交易市场']);
T.flow('快速买积分', ['买积分', /* 这里需要检查验证码输入 */ '卖积分']);
T.flow('卖积分自动到达密码', ['卖积分提交', '卖积分确认上架']);
T.flow('卖积分密码填好后自动确认并关闭弹窗', ['卖积分弹窗提交', '卖积分通知成功弹窗关闭']);

T.flow('快速买交易币', ['买交易币', /* 这里需要检查验证码输入 */ '卖交易币']);
T.flow('卖交易币自动到达密码', ['卖交易币提交', '卖交易币确认上架']);
T.flow('卖交易币密码填好后自动确认并关闭弹窗', ['卖交易币弹窗提交', '卖交易币通知成功弹窗关闭']);

T.flow('买交易币所有流程', 
    ['买交易币', '卖交易币', '卖交易币填入交易币和积分', 
        '卖交易币提交', '卖交易币确认上架', '卖交易币填入密码',
    '卖交易币弹窗提交', '卖交易币通知成功弹窗关闭'])

T.flow('查看行情', ['交易市场']);
