
var T = darkrp.trigger;

T.flow('进入交易市场', ['登录', '离线登录', '弹窗确定', '积分商城', '交易市场']);

T.flow('卖积分流程', ['上架我的', '卖积分', '卖积分填入积分和交易币', 
        '卖积分提交', '卖积分确认上架', '卖积分填入密码',
    '卖积分弹窗提交', '卖积分通知成功弹窗关闭']);

T.flow('卖交易币流程', ['上架我的', '卖交易币', '卖交易币填入交易币和积分', 
        '卖交易币提交', '卖交易币确认上架', '卖交易币填入密码',
    '卖交易币弹窗提交', '卖交易币通知成功弹窗关闭']);

T.flow('买交易币市场信息获取', 
    ['买交易币', '验证码窗口探测并解析处理', '买交易币市场正在出售信息', '买交易币市场交易信息导入变量', '买交易币市场交易信息2', '返回上次界面']);

T.flow('买积分市场信息获取', 
    ['买积分', '验证码窗口探测并解析处理', '买积分市场正在出售信息', '买积分市场交易信息导入变量', '买积分市场交易信息2', '返回上次界面']);

T.flow('自动填入验证码', ['验证码窗口探测并解析处理']);
